판다스는 많은 부분이 넘파이를 기반으로 작성되었다.
판다스는 파이썬의 리스트, 컬렉션, 넘파이등의 내부 데이터뿐만 아니라 CSV 등의 파일을 쉽게 DataFrame으로 변경해 데이터의 가공/분석을 편리하게 만들어 준다.

판다스는 dataframe과 많은 연관되었다.
dataframe을 이해하기 위해서는 index와 series를 이해하는 것이 중요하다.

1. INDEX: RDBMS의 PK처럼 개별 데이터를 공유하게 식별하는 KEY값이다.
2. SERIES: INDEX를 KEY값으로 가지고 있는 칼럼이 1개인 데이터 구조
3. DATAFRAME: INDEX를 KEY값으로 가지는 칼럼이 여러개인 데이터 구조
    =>여러개의 SERIES로 구성되었다고도 말한다.
    
판다스는 csv, tab과 같은 다양한 유형의 분리 문자로 칼럼을 분리한 파일을 손쉽게 dataframe으로 로딩 할 수 있게 만든다.

In [3]:
import pandas as pd

판다스는 다양한 포맷으로 된 파일을 dataframe으로 로딩할 수 있는 편리한 API를 제공한다.
1. read_csv() :cvs뿐만아니라 어떤 필드 구분 문자 기반의 파일 포맷도 dataframe으로 변환이 가능하다. 대신에 sep에 해당 구분 문자를 입력하면 된다.
2. read_table(): 구분 문자가 tab인것을 제외하고 read_csv()와 유사하다.
3. read_fwf() :고정 길이 기반의 칼럼 포맷을 dataframe으로 로딩하기 위한 API이다.

pd.read_csv()
1. 호출 시 파일명 인자로 들어온 파일을 로딩해 dataframe 객체로 반환한다.
2. 별다른 파라미터 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 인지하고 칼럼으로 변환한다.
3. 칼럼명도 표시되지 않은 데이터들은 판다스의 index 객체 값이다.=> 모든 dataframe내의 데이터는 생성되는 순간 고유의 index값을 가진다.

dataframe.head(N): dataframe의 맨 앞에 있는 N개의 로우를 반환한다.

daraframe.shape : dataframe의 행과 열 크기를 알아보는 가장 좋은 방법이다.

In [4]:
titanic = pd.read_csv('train.csv')

In [5]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
titanic.shape

(891, 12)

dataframe은 데이터뿐만 아닝라 칼럼의 타입, null 데이터 개수, 데이터 분포 등의 메타 데이터등도 조회가 가능하다.

1. info() 메서드: 총 데이터 건수/ 데이터 타입/ Null 건수를 알 수 있다.
2. describe() 메서드: 칼럼별 숫자형 데이터 값의 n-percentile 분포도/ 평균값/ 최대값/ 최솟값을 나타낸다=> 오직 숫자형 칼럼 분포도만 조사하여 자동으로 object 타입의 칼럼은 출력에서 제외시킨다.

데이터 분포의 회귀 값에서 결정값이 정균 분포를 이루지 않거나/ 특정 값으로 왜곡되었을때/ 데이터의 값에 이상치가 많을 때 
=>예측 성능이 저하된다.

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

1. count: not null인 데이터의 건수
2. mean: 전체 데이터의 평균값
3. std: 표준편차
4. min: 최솟값
5. max: 최댓값

dataframe[칼럼명]=series 형태로 특정 칼럼 데이터 세트가 반환된다.
객체에 value_counts()메서드를 호출하면 해당 칼럼의 유형과 건수를 확인할 수 있다.

In [9]:
counts=titanic['Pclass'].value_counts()
print(counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [10]:
import numpy as np

col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)
df_list1=pd.DataFrame(list1, columns=col_name1)
print(df_list1)
print("")
df_array1=pd.DataFrame(array1, columns=col_name1)
print(df_array1)

   col1
0     1
1     2
2     3

   col1
0     1
1     2
2     3

In [11]:
dics={'col':[1,11],'col1':[2,22], 'col2':[3,33]}
df_dic=pd.DataFrame(dics)
print(df_dic)

   col  col1  col2
0    1     2     3
1   11    22    33

DataFrame을 다시 ndarray/ list/ dictionary 로 다시 변환 할 수 있다.

In [12]:
# ndarray로 변환=> values 이용
array1=df_dic.values
print(array1)

[[ 1  2  3]
 [11 22 33]]

In [13]:
# list로 변환=> values에서 tolist()호출
list1= df_dic.values.tolist()
print(list1)

[[1, 2, 3], [11, 22, 33]]

In [14]:
# dictionary로 변환=> to_dict()메서드 호출, ()안에 list를 입력하면 리스트형으로 반환
dict1=df_dic.to_dict('list')
print(dict1)

{'col': [1, 11], 'col1': [2, 22], 'col2': [3, 33]}

DataFrame의 칼럼 데이터 세트 생성과 수정=> [ ] 사용

In [15]:
titanic['Age_0']=0
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [22]:
#새로운 칼럼은 기존 칼럼을 이용해서 만들 수 있다.
#기존 칼럼 업데이트 가능하다.
titanic['Age_0']=titanic['Age_0']+10
titanic['Family_no']=titanic['SibSp']+titanic['Parch']
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Family_no
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,10,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,10,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,10,0

Drop( ) 메서드: DataFrame 데이터 삭제
1. axis=0// 로우 방향 축->label=인덱스로 간주
2. axis=1// 칼럽 방향 축->칼럼명
3. inplace, 디폴드 값= False이므로 원래 DataFrame을 삭제하지 않고 따로 저장
4. inplace=True이면 원래의 DataFrame을 삭제하고 새로운 DataFrame만이 존재한다.
    =>inplace=True로 설정한 채로 반환 값을 다시 자신의 DataFrame 객체로 할당하면 안된다.

In [17]:
titanic_drop=titanic.drop('Age_0', axis=1)
titanic_drop.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

index 객체: DataFrame,Series의 레코드를 고유하게 식별하는 개체
1. Index 객체의 실제 값은 넘파이 1차원 ndarray로 볼 수 있다.
2. 한 번 만들어진 DataFrame 및 Series 객체에 연산 함수를 적용할때 index는 연산에서 제외된다.
3. DataFrame 및 Series에 reset_index()메서드를 수행하면 새로운 칼럼명으로 추가한다.

In [19]:
titanic_reset=titanic.reset_index(inplace=False)
titanic_reset.head(3)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

데이터 셜렉션 및 필터링

판다스의 데이터 셀력션과 넘파이와 상당히 유사하기도 하지만 다른부분도 많다.

1. DataFrame []의 연산자
[ ]은 칼럼만 들어갈수있는 칼럼 지정 연산자로 생각하고 현재는 이해하는게 좋다.
1. [0],[0,1,2]와 같은 형태가 들어가면 오류가 발생한다.=> 단일 추출이 불가능하다.
2. 하지만 인데스 형태는 출력이 가능하다.=> [0:2]와 같은 모양
3. 불린 인덱싱도 가능하다.

In [3]:
#불린 인덱싱 예시
titanic[titanic['Pclass']=3].head(3)
#왜 결과 값이 안나오는 걸까?

SyntaxError: invalid syntax (<ipython-input-3-b737d8c0397a>, line 2)

DataFrame ix[]연산자
1. 판다스는ix[인덱스 값, '칼럼명/칼럼의 위치 값']를 통해 원하는 위치 데이터 추출한다.
2. 하지만 칼럼 위치에 칼럼명과 위치 값 둘다 되면서 가동성이 떨어져 현재는 사라졌다.
3. 대신할 명칭 기반 인덱스인 loc[]와 인덱싱 연산자인 lioc[]가 새롭게 만들어졌다.
4. DataFrame의 인데스 값은 명칭 기반 인덱싱이다.
5. loc[ ]에 슬라이싱을 하면 종료값-1이 아니라 종료값까지 나타내는 것을 표현한다.

불린인덱싱
1. [], ix[], loc[]에서 공통으로 지원한다.
2. iloc[]은 정수형 값이 아닌 불린 값에 대해서 지원하지 않기 때문에 불린 인덱스를 지원하지 않는다.